In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:root@localhost/

In [3]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [4]:
%%sql
use uber

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

## UNION – Conditions

* Number of columns in all SELECT queries must be same
* Data types of corresponding columns must be same or compatible
* Column order must be same
* Removes duplicate rows

## UNION ALL – Conditions
* Number of columns in all SELECT queries must be same
* Data types of corresponding columns must be same or compatible
* Column order must be same
* Does not remove duplicate rows

In [5]:
%%sql
DROP TABLE IF EXISTS employees;
DROP TABLE IF EXISTS contractors;

CREATE TABLE employees (
    employee_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name  VARCHAR(50),
    last_name   VARCHAR(50),
    position    VARCHAR(50),
    salary      DECIMAL(10,2)
);

CREATE TABLE contractors (
    contractor_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name    VARCHAR(50),
    last_name     VARCHAR(50),
    position      VARCHAR(50),
    hourly_rate   DECIMAL(10,2)
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [7]:
%%sql
INSERT INTO employees (first_name, last_name, position, salary)
VALUES
('Alice', 'Smith', 'Developer', 70000.00),
('Bob', 'Johnson', 'Developer', 75000.00),
('Charlie', 'Lee', 'Manager', 90000.00);

INSERT INTO contractors (first_name, last_name, position, hourly_rate)
VALUES
('Dave', 'Williams', 'Developer', 40.00),
('Eve', 'Brown', 'Tester', 35.00),
('Bob', 'Johnson', 'Developer', 45.00);

 * mysql+pymysql://root:***@localhost/
3 rows affected.
3 rows affected.

[]

In [8]:
%%sql
select * from employees
union
select * from contractors;

 * mysql+pymysql://root:***@localhost/
6 rows affected.

[(1, 'Alice', 'Smith', 'Developer', Decimal('70000.00')),
 (2, 'Bob', 'Johnson', 'Developer', Decimal('75000.00')),
 (3, 'Charlie', 'Lee', 'Manager', Decimal('90000.00')),
 (1, 'Dave', 'Williams', 'Developer', Decimal('40.00')),
 (2, 'Eve', 'Brown', 'Tester', Decimal('35.00')),
 (3, 'Bob', 'Johnson', 'Developer', Decimal('45.00'))]

In [12]:
%%sql
select first_name,last_name from employees
union 
select last_name,first_name from contractors;

 * mysql+pymysql://root:***@localhost/
6 rows affected.

[('Alice', 'Smith'),
 ('Bob', 'Johnson'),
 ('Charlie', 'Lee'),
 ('Williams', 'Dave'),
 ('Brown', 'Eve'),
 ('Johnson', 'Bob')]

## Indexing
Index (in DBMS) – An index is a database object that improves the speed of data retrieval from a table by creating a structured reference to column values, at the cost of additional storage and slower insert/update operations.

In [16]:
%%sql
-- with index
drop table if exists customers;

CREATE TABLE customers (
    customer_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name   VARCHAR(50)  NOT NULL,
    last_name    VARCHAR(50)  NOT NULL,
    email        VARCHAR(100) NOT NULL,
    city         VARCHAR(100) NOT NULL
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [15]:
%%sql
-- without index
drop table if exists customers1;

CREATE TABLE customers1 (
    customer_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name   VARCHAR(50)  NOT NULL,
    last_name    VARCHAR(50)  NOT NULL,
    email        VARCHAR(100) NOT NULL,
    city         VARCHAR(100) NOT NULL
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [17]:
%%sql
CREATE INDEX idx_email ON customers(email);

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [18]:
%%sql
INSERT INTO customers (first_name, last_name, email, city)
VALUES
('John', 'Doe', 'john@example.com', 'New York'),
('Jane', 'Smith', 'jane.smith@example.com', 'Los Angeles'),
('Michael', 'Brown', 'michael.brown@example.com', 'Chicago'),
('Emily', 'Johnson', 'emily.johnson@example.com', 'Houston'),
('Robert', 'Green', 'robert.green@example.com', 'Phoenix');

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[]

In [19]:
%%sql
INSERT INTO customers1 (first_name, last_name, email, city)
VALUES
('John', 'Doe', 'john@example.com', 'New York'),
('Jane', 'Smith', 'jane.smith@example.com', 'Los Angeles'),
('Michael', 'Brown', 'michael.brown@example.com', 'Chicago'),
('Emily', 'Johnson', 'emily.johnson@example.com', 'Houston'),
('Robert', 'Green', 'robert.green@example.com', 'Phoenix');

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[]

In [26]:
%%sql
-- without index
-- this explain key word is used to is it using the inedx values are not (possbile keys) it shows the index value
EXPLAIN 
select * from customers1
where email = 'john@example.com';

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[(1, 'SIMPLE', 'customers1', None, 'ALL', None, None, None, None, 5, 20.0, 'Using where')]

In [27]:
%%sql
-- with index
-- this explain key word is used to is it using the inedx values are not (possbile keys) it shows the index value
EXPLAIN 
select * from customers
where email = 'john@example.com';

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[(1, 'SIMPLE', 'customers', None, 'ref', 'idx_email', 'idx_email', '402', 'const', 1, 100.0, None)]

In [28]:
%%sql
-- without index
-- the analyze it gives the time durations for the query 
EXPLAIN ANALYZE
select * from customers1
where email = 'john@example.com';

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[("-> Filter: (customers1.email = 'john@example.com')  (cost=0.75 rows=1) (actual time=0.118..0.128 rows=1 loops=1)\n    -> Table scan on customers1  (cost=0.75 rows=5) (actual time=0.0329..0.0413 rows=5 loops=1)\n",)]

In [30]:
%%sql
-- with index
-- the analyze it gives the time durations for the query 
EXPLAIN ANALYZE
select * from customers
where email = 'john@example.com';

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[("-> Index lookup on customers using idx_email (email='john@example.com')  (cost=0.35 rows=1) (actual time=0.0192..0.0209 rows=1 loops=1)\n",)]